src/test/java/performance/EarlyAccessPerformanceTest.yml
---
settings:
  app.host: 10.17.5.5

execution:
  - concurrency: 5
    ramp-up: 1m
    hold-for: 1m30s
    scenario: basic-performance-test

scenarios:
  basic-performance-test:
    think-time: 0.75
    requests:
      - https://${app.host}/v2/club-o-rewards-program
      - https://${app.host}/club-o-rewards-program